# Solutions for Topic 3 Exercise Sheet

_Note: Cell Language is set to MSSQL and does connect to any data source. SQL generated on 2425-AppDB machine with employees database.</br>
Comment are in MS SQL Format "--"_

1. Get employees.sql from Moodle and import it into MySQL.

Applied SQL Script to generate MySQL 'employee' database within 2425-appDB machine: [employee.sql](https://github.com/ngn73/8637_applied_databases/blob/main/resources/sql/employees.sql)

2. Print out the emp_no, first_name and a capitalised version of the employees last_name,
using the same column names that are in the table for the first 10 employees returned from
the database

In [ ]:
SELECT emp_no, first_name, UPPER(last_name) FROM employees LIMIT 10;

3. Sort the employees table based on:</br>
- The length of last_name</br>
- Alphabetical order of last_name</br>
- The length of first_name</br>
- Alphabetical order of first_name</br>

In [ ]:
USE employees;

SELECT * FROM employees
ORDER BY LENGTH(last_name);

SELECT * FROM employees
ORDER BY last_name ASC;

SELECT * FROM employees
ORDER BY LENGTH(first_name);

SELECT * FROM employees
ORDER BY first_name ASC;

4. Show all details of the first 10 employees returned from the database and an extra column
called Initials that shows the employee’s initials.

In [ ]:
SELECT *, CONCAT(SUBSTRING(first_name, 1, 1), SUBSTRING(last_name, 1, 1)) AS initials FROM employees LIMIT 10;

5. Show all details of all Females born in the 1950s and hired between September 1st 1988 and
February 28th 1991.

In [ ]:
SELECT * FROM employees 
WHERE 
gender = 'F'
AND
YEAR(birth_date) BETWEEN 1950 AND 1959
AND
hire_date BETWEEN '1988-09-01' AND '1991-02-28';

6. Show the average salary from the salaries table formatted to two decimal places.
E.g. 12345.6789 should become 12,345.68.

In [ ]:
SELECT FORMAT(AVG(salary), 2) AS 'avg_salary' FROM salaries;

7. Show the emp_no and average salary for each employee formatted to two decimal places.

In [ ]:

SELECT emp_no, FORMAT(AVG(salary), 2) AS 'avg_salary'
FROM salaries
GROUP BY emp_no;

8. Show the emp_no and maximum salary for each employee formatted to two decimal places.

In [ ]:
SELECT emp_no, FORMAT(MAX(salary), 2) AS 'avg_salary'
FROM salaries
GROUP BY emp_no;

9. Show the emp_no and average salary formatted to two decimal places for the following
employee numbers: 10001, 10021, 10033 and 10087.
But only include in the average calculation salaries greater than 80,000.

In [ ]:
SELECT emp_no, FORMAT(AVG(salary), 2) AS 'avg_salary'
FROM salaries 
WHERE 
emp_no IN (10001, 10021, 10033, 10087)
AND
salary > 80000
GROUP BY emp_no

10. Show the emp_no and average salary rounded to the nearest whole number only for
average salaries greater than 90,000.

In [ ]:

SELECT emp_no, FORMAT(AVG(salary), 0) FROM salaries
GROUP BY emp_no
HAVING AVG(salary) > 9000;

11. Show the following details, in the following order, for the first 15 employees, in emp_no
order:
ID, Title, Name, Surname, Gender.
Title should be “Mr.” if the employee is Male, and “Ms.” if the employee is female.

In [ ]:
SELECT 
emp_no AS 'ID', 
CASE
	WHEN gender = 'M' THEN 'Mr.'
	WHEN gender = 'F' THEN 'Ms.'
END AS 'Title',
first_name AS 'Name', last_name AS 'Surname', gender AS 'Gender'
FROM employees
ORDER BY emp_no ASC
LIMIT 15;

12. Show the following details emp_no, the maximum salary for each employee, and the tax
bracket the employee’s maximum salary is in (Tax Bracket).
Tax brackets are defined as follows:</br>

|Max |Salary |Tax Bracket|
|----|-------|-----------|
|Under| 40,000| 30%|
|Under| 60,000| 40%|
|Under| 80,000| 50%|
|Over| 80,000| 60%|

In [ ]:
SELECT 
emp_no AS 'ID', 
FORMAT(MAX(salary), 2) AS 'Max Salary',
CASE
	WHEN MAX(salary) < 40000 THEN '30%'
	WHEN MAX(salary) < 60000 THEN '40%'
	WHEN MAX(salary) < 80000 THEN '50%'
	WHEN MAX(salary) >= 80000 THEN '60%'
END AS 'Tax Bracket'
FROM salaries
GROUP BY emp_no

13. Show all details from the salaries table as well as a column entitled “Time” which states
“Under 1 yr” if the employee has been on a particular salary for less than 365 days,
otherwise states “Over 1 yr”.

In [ ]:
SELECT *,
CASE
WHEN DATEDIFF(NOW(), from_date) < 365 THEN 'Under 1 yr' 
ELSE 'Over 1 yr'
END AS 'Time' 
FROM salaries

14. . Using a function show all columns from the employees table, and a column entitled “Age”
which is the age the employee was when he or she was hired. The age should be rounded to
1 digit after the decimal place.</br>
For example, employee 10001 was 32.8 years old when he was hired.</br>
**HINT**: Don’t for get to change the delimiter when writing the function and change it back to
a semi-colon when the function is written.

SELECT *, ROUND(( DATEDIFF(curdate(), hire_date) / 365.2), 1) AS AGE
FROM employees
WHERE emp_no = '10001';

15. Write a procedure that takes two parameters, one representing a year and the other a
month.
The procedure should return all employees hired in specified year and month.

In [ ]:
CREATE PROCEDURE emp_hired (IN hire_year INT, OUT hire_month INT)
       BEGIN
        SELECT * FROM employees
        WHERE YEAR(date_hire) = hire_year AND MONTH(date_hire) = month_year
       END//

16. Rewrite the above procedure so that if the month parameter is NULL the procedure returns
all employees hired in the specified year.</br>
If the month is not NULL, the procedure works as it did previously.</br></br></br>
HINT: To call a procedure with a NULL value for month (assuming in this case month is the
second parameter) procedure_name(1985, NULL).
- To check if a parameter, e.g. m, is NULL say IF M IS NULL THEN</br>
- To check if a parameter, e.g. m, is not NULL say IF M IS NOT NULL THEN.</br>

In [ ]:
CREATE PROCEDURE emp_hired (IN hire_year INT, OUT hire_month INT)
       BEGIN
        SELECT * FROM employees
        WHERE (YEAR(date_hire) = hire_year AND (date_month IS NULL OR MONTH(date_hire) = month_year))
       END//